app/views/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 2]]
---
                       <hr>
                               <h2>Comments(<%=@article.comments.size%>)</h2>

SELECT 1 AS one FROM "comments" WHERE "comments"."article_id" = $1 LIMIT $2  [["article_id", 1], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = $1  [["article_id", 1]]
---
                <div class="col-md-12">
<% unless @article.comments.empty?%>
<% @article.comments.each do |comment| %>