app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY "articles"."created_at" DESC
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "created_at", "updated_at", "status", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "boilhoil"], ["body", "ilhkjopjkp["], ["created_at", "2022-06-01 13:19:45.304094"], ["updated_at", "2022-06-01 13:19:45.304094"], ["status", nil], ["user_id", 6]]
---
  def create
    @article = @current_user.articles.new(article_params)
    #@article = Article.new(article_params)

    if @article.save