app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mesxiana3@gmail.com"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params['email'].downcase)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def editprofile
    @user = User.find_by(id: @current_user.id)

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "[FILTERED]"], ["updated_at", "2022-06-03 13:08:09.548410"], ["id", 13]]
---
  def save_editied_profile

  #  redirect_to root_path, notice: @current_user.id
  #  redirect_to root_path, notice: update_status if  update_status.update(username: params['username'], email: params['email'])
    if invalid_current_password
      flash[:alert]= "your current password isn't equal to old password"
    elsif  @current_user.update(update_user_params)